//
//  Model.swift
//  VideoCollection
//
//  Created by Emil Atanasov on 12/13/23.
//

import Foundation

/// Структура - видео колекция. Представя колекция от видео файлове.
struct VideoCollection {
    /// Име на колекцията
    var name: String
    /// Икона от стандартните SF Symbols
    var iconName: String
    /// Списък с видеа
    var videos: [Video] = []
}

extension VideoCollection: Hashable {
    static func == (lhs: VideoCollection, rhs: VideoCollection) -> Bool {
        lhs.name == rhs.name
    }
}

extension VideoCollection: Identifiable {
    var id: String { name }
}

/// Структура, която представя един видео файл.
struct Video: Hashable {
    var title: String
    var description: String
    var videoFile: String
    var thumbnail: String
    var progress: Double
    var duration: Double
}

extension Video: Identifiable {
    var id: String {
        title
    }
    
    var videoFileUrl: URL? {
        guard let path = Bundle.main.path(forResource: videoFile, ofType:"mp4") else {
            return nil
        }
        return URL(fileURLWithPath: path)
    }
}

extension Video {
    static var mock: Video {
        Video(title: "Планетата земя", description: "Земята е третата планета в Слънчевата система. Тя е най-голямата от земеподобните планети и единствената, на която според съвременните научни схващания има живот. Земята се е образувала преди около 4,54 милиарда години и скоро след това е придобила единствения си естествен спътник – Луната. От всички животински видове, които са се развили на Земята, единствено човекът (Homo sapiens) притежава разум.", videoFile: "earth", thumbnail: "earth_thumb", progress: 0.5, duration: 31.0)
    }
}

/// Изберете правилната реализация на view-model-а
/// Ако е необходимо може да промените типа от struct на class

/// Тестови данни може да намерите тук

extension VideoCollection {
    static var mocks: [VideoCollection] {
        let collections = [VideoCollection]()
        
        var nature = VideoCollection(name: "Природа", iconName: "globe.europe.africa.fill")
        nature.videos.append(Video(title: "Планетата земя", description: "Земята е третата планета в Слънчевата система. Тя е най-голямата от земеподобните планети и единствената, на която според съвременните научни схващания има живот. Земята се е образувала преди около 4,54 милиарда години и скоро след това е придобила единствения си естествен спътник – Луната. От всички животински видове, които са се развили на Земята, единствено човекът (Homo sapiens) притежава разум.", videoFile: "earth", thumbnail: "earth_thumb", progress: 0.5, duration: 31.0))
        nature.videos.append(Video(title: "Планетата земя", description: "Земята е третата планета в Слънчевата система. Тя е най-голямата от земеподобните планети и единствената, на която според съвременните научни схващания има живот. Земята се е образувала преди около 4,54 милиарда години и скоро след това е придобила единствения си естествен спътник – Луната. От всички животински видове, които са се развили на Земята, единствено човекът (Homo sapiens) притежава разум.", videoFile: "earth", thumbnail: "earth_thumb", progress: 0.5, duration: 31.0))
        nature.videos.append(Video(title: "Планетата земя", description: "Земята е третата планета в Слънчевата система. Тя е най-голямата от земеподобните планети и единствената, на която според съвременните научни схващания има живот. Земята се е образувала преди около 4,54 милиарда години и скоро след това е придобила единствения си естествен спътник – Луната. От всички животински видове, които са се развили на Земята, единствено човекът (Homo sapiens) притежава разум.", videoFile: "earth", thumbnail: "earth_thumb", progress: 0.5, duration: 31.0))
        var coding = VideoCollection(name: "Софтуер", iconName: "keyboard.fill")
        coding.videos.append(Video(title: "Софтуер", description: "Софтуерът (програмно осигуряване, програмно обезпечение, на английски: software, буквално „меко изделие“, също и „лек товар, леко снаряжение“) е съвкупността от цялата информация от инструкции и данни, необходими за работата на всяка електронноизчислителна машина. Употребява се главно в сферата на информационните технологии. Обикновено инструкциите се задават като съвкупност от алгоритми, групирани като програми с различно предназначение. Освен самите алгоритми, за изпълнението на програмите са необходими и начални данни. Резултатът от действието на даден алгоритъм може да служи като начални данни за стартирането на друг и т.н., обединявайки програмите в едно. В този смисъл все повече се налага и терминът софтуер, който исторически се е наложил като антоним на хардуер – физическата част на компютърните системи. Все пак границата между софтуер и хардуер се размива, когато се отчете, че програмното осигуряване има все пак някакви физически носители, от които изчислителната машина чете програмите. Тези носители, както и инструкциите за работа с програмите и тяхната поддръжка (документация), са спомагателни елементи от софтуера. ", videoFile: "notebook", thumbnail: "notebook_thumb", progress: 0.5, duration: 12.0))
        coding.videos.append(Video(title: "Софтуер", description: "Софтуерът (програмно осигуряване, програмно обезпечение, на английски: software, буквално „меко изделие“, също и „лек товар, леко снаряжение“) е съвкупността от цялата информация от инструкции и данни, необходими за работата на всяка електронноизчислителна машина. Употребява се главно в сферата на информационните технологии. Обикновено инструкциите се задават като съвкупност от алгоритми, групирани като програми с различно предназначение. Освен самите алгоритми, за изпълнението на програмите са необходими и начални данни. Резултатът от действието на даден алгоритъм може да служи като начални данни за стартирането на друг и т.н., обединявайки програмите в едно. В този смисъл все повече се налага и терминът софтуер, който исторически се е наложил като антоним на хардуер – физическата част на компютърните системи. Все пак границата между софтуер и хардуер се размива, когато се отчете, че програмното осигуряване има все пак някакви физически носители, от които изчислителната машина чете програмите. Тези носители, както и инструкциите за работа с програмите и тяхната поддръжка (документация), са спомагателни елементи от софтуера. ", videoFile: "notebook", thumbnail: "notebook_thumb", progress: 0.5, duration: 12.0))
        coding.videos.append(Video(title: "Софтуер", description: "Софтуерът (програмно осигуряване, програмно обезпечение, на английски: software, буквално „меко изделие“, също и „лек товар, леко снаряжение“) е съвкупността от цялата информация от инструкции и данни, необходими за работата на всяка електронноизчислителна машина. Употребява се главно в сферата на информационните технологии. Обикновено инструкциите се задават като съвкупност от алгоритми, групирани като програми с различно предназначение. Освен самите алгоритми, за изпълнението на програмите са необходими и начални данни. Резултатът от действието на даден алгоритъм може да служи като начални данни за стартирането на друг и т.н., обединявайки програмите в едно. В този смисъл все повече се налага и терминът софтуер, който исторически се е наложил като антоним на хардуер – физическата част на компютърните системи. Все пак границата между софтуер и хардуер се размива, когато се отчете, че програмното осигуряване има все пак някакви физически носители, от които изчислителната машина чете програмите. Тези носители, както и инструкциите за работа с програмите и тяхната поддръжка (документация), са спомагателни елементи от софтуера. ", videoFile: "notebook", thumbnail: "notebook_thumb", progress: 0.5, duration: 12.0))
        var games = VideoCollection(name: "Забава", iconName: "gamecontroller.fill")
        games.videos.append(Video(title: "Софтуер", description: "Компютърната игра е видеоигра, която се играе предимно на персонален компютър. Играта, сама по себе си, предполага участието на поне един играч, който може да влияе на средата, в която е поставен. Компютърните игри се създават от специализирани софтуерни компании, често в сътрудничество с различни специалисти и се публикуват самостоятелно или чрез външна фирма. Разпространяват се на твърди носители, като DVD-та или CD-та, свалят се от интернет за изпробване или се използват специализирани онлайн услуги за доставка.", videoFile: "keyboard", thumbnail: "keyboard_thumb", progress: 0.5, duration: 23.0))
        games.videos.append(Video(title: "Софтуер", description: "Компютърната игра е видеоигра, която се играе предимно на персонален компютър. Играта, сама по себе си, предполага участието на поне един играч, който може да влияе на средата, в която е поставен. Компютърните игри се създават от специализирани софтуерни компании, често в сътрудничество с различни специалисти и се публикуват самостоятелно или чрез външна фирма. Разпространяват се на твърди носители, като DVD-та или CD-та, свалят се от интернет за изпробване или се използват специализирани онлайн услуги за доставка.", videoFile: "keyboard", thumbnail: "keyboard_thumb", progress: 0.5, duration: 23.0))
        games.videos.append(Video(title: "Софтуер", description: "Компютърната игра е видеоигра, която се играе предимно на персонален компютър. Играта, сама по себе си, предполага участието на поне един играч, който може да влияе на средата, в която е поставен. Компютърните игри се създават от специализирани софтуерни компании, често в сътрудничество с различни специалисти и се публикуват самостоятелно или чрез външна фирма. Разпространяват се на твърди носители, като DVD-та или CD-та, свалят се от интернет за изпробване или се използват специализирани онлайн услуги за доставка.", videoFile: "keyboard", thumbnail: "keyboard_thumb", progress: 0.5, duration: 23.0))
        
        return collections
    }
}
